ANDRUXA_TANENBAUM_PHRASES = [
    "Что хорошо в стандартах, так это то, что у вас всегда есть из чего выбрать. \n\n - Компьютерные сети",
    "Вероятно, такая ситуация сложилась из-за ошибки одного из программистов BIOS, который писай свой шедевр на ассемблере 8088.\n\n - Архитектура компьютера",
    "В компьютерной отрасли трудно подобрать название, которое бы не выглядело смешно 30 лет спустя.\n\n - Архитектура компьютера",
    "Демон - служебная программа в некоторых операционных системах (преимущественно основанных на UNIX), работающая в фоновом режиме без непосредственного взаимодействия с пользователем.\n\n - Современные операционные системы",
    "Голодание (зависание процесса) - ситуация, когда все программы бесконечно работают, но не могут добиться никакого прогресса.\n\n - Современные операционные системы",
    "Самые быстрые блокировки - отсутствие всяких блокировок.\n\n - Современные операционные системы",
    "Рецепт - это программа (алгоритм, выраженный в некой удобной форме записи), программист - центральный процессор, ингредиенты - входные данные, процесс - действия, состоящие из чтения рецепта, выпечки...\n\n - Современные операционные системы",
    "Авторы этой книги предсказывают, что конец цивилизации произойдет в полночь 31 декабря 9999 года, когда сразу уничтожатся все программы, написанные за 8000 лет на языке COBOL.\n\n - Архитектура компьютера",
    "В компьютерной отрасли трудно подобрать название, которое бы не выглядело смешно 30 лет спустя.\n\n - Архитектура компьютера",
    "Исторически использовали и развивали искусство криптографии представители четырех профессий: военные, дипломатический корпус, люди, ведущие дневник, и любовники.",
    "Боб не знает закрытого ключа Алисы, следовательно, получить зашифрованное этим ключом сообщение он мог только от Алисы. Сидя в тюрьме за лжесвидетельство и мошенничество, Алиса сможет заняться разработкой новых интересных алгоритмов с открытым ключом.",
    "Аудио-компакт-диски содержат звуковой сигнал, оцифрованный с частотой дискретизации 44 100 Гц, в результате чего они могут хранить звуки с частотами до 22 кГц, что воспринимается как достаточно качественный звук людьми, но считается весьма низким качеством среди собак, ценящих хорошую музыку.\n\n - Компьютерные сети",
    "Проект был назван Bluetooth («Синий зуб») в честь великого короля викингов по имени Гаральд Синий Зуб II (940—981), который объединил (читай, завоевал) Данию и Норвегию. Ну да, он тоже сделал это без помощи проводов.",
    "В Unix-системах есть команда - nice, позволяющая пользователю добровольно снизить приоритет свое процесса, чтобы угодить другим пользователям, но ею никто никогда не пользуется.",
]

IS_TANENBAUM = "таненбаума давай хули"

MESSAGE_MAX_LEN = 80
